espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_prs_signals.h
#define PRS_ASYNC_EUSART2L_RXFL                                (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART2L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART2LRXFL)
#define PRS_ASYNC_EUSART2L_TXFL                                (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART2L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART2LTXFL)
#define PRS_ASYNC_EUSART3L_CS                                  (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3LCS)
#define PRS_ASYNC_EUSART3L_IRDATX                              (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3LIRDATX)
#define PRS_ASYNC_EUSART3L_RTS                                 (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3LRTS)
#define PRS_ASYNC_EUSART3L_RXDATAV                             (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3LRXDATAV)
#define PRS_ASYNC_EUSART3L_RXFL                                (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3LRXFL)
#define PRS_ASYNC_EUSART3L_TX                                  (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3LTX)
#define PRS_ASYNC_EUSART3L_TXC                                 (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3LTXC)
#define PRS_ASYNC_EUSART3L_TXFL                                (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART3LTXFL)
#define PRS_ASYNC_EUSART4L_CS                                  (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART4L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART4LCS)
#define PRS_ASYNC_EUSART4L_IRDATX                              (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART4L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART4LIRDATX)
#define PRS_ASYNC_EUSART4L_RTS                                 (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART4L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART4LRTS)
#define PRS_ASYNC_EUSART4L_RXDATAV                             (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART4L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART4LRXDATAV)
#define PRS_ASYNC_EUSART4L_RXFL                                (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART4L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART4LRXFL)
#define PRS_ASYNC_EUSART4L_TX                                  (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART4L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART4LTX)
#define PRS_ASYNC_EUSART4L_TXC                                 (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART4L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART4LTXC)
#define PRS_ASYNC_EUSART4L_TXFL                                (PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART4L | PRS_ASYNC_CH_CTRL_SIGSEL_EUSART4LTXFL)
#define PRS_ASYNC_TIMER5_UF                                    (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER5UF)
#define PRS_ASYNC_TIMER5_OF                                    (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER5OF)
#define PRS_ASYNC_TIMER5_CC0                                   (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER5CC0)
#define PRS_ASYNC_TIMER5_CC2                                   (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER5CC2)
#define PRS_ASYNC_TIMER5_CC1                                   (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER5CC1)
#define PRS_ASYNC_TIMER6_UF                                    (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER6UF)
#define PRS_ASYNC_TIMER6_OF                                    (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER6OF)
#define PRS_ASYNC_TIMER6_CC0                                   (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER6CC0)
#define PRS_ASYNC_TIMER6_CC1                                   (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER6CC1)
#define PRS_ASYNC_TIMER6_CC2                                   (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER6CC2)
#define PRS_ASYNC_TIMER7_UF                                    (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER7UF)
#define PRS_ASYNC_TIMER7_OF                                    (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER7OF)
#define PRS_ASYNC_TIMER7_CC0                                   (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER7CC0)
#define PRS_ASYNC_TIMER7_CC1                                   (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER7CC1)
#define PRS_ASYNC_TIMER7_CC2                                   (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER7CC2)
#define PRS_ASYNC_RFFPLL0L_CLKDIGDIV4                          (PRS_ASYNC_CH_CTRL_SOURCESEL_RFFPLL0L | PRS_ASYNC_CH_CTRL_SIGSEL_RFFPLL0LCLKDIGDIV4)
#define PRS_ASYNC_RFFPLL0L_CLKMODEMDIV4                        (PRS_ASYNC_CH_CTRL_SOURCESEL_RFFPLL0L | PRS_ASYNC_CH_CTRL_SIGSEL_RFFPLL0LCLKMODEMDIV4)
#define PRS_ASYNC_FEFILT0_REMPTY                               (PRS_ASYNC_CH_CTRL_SOURCESEL_FEFILT0 | PRS_ASYNC_CH_CTRL_SIGSEL_FEFILT0REMPTY)
#define PRS_ASYNC_FEFILT0_WFULL                                (PRS_ASYNC_CH_CTRL_SOURCESEL_FEFILT0 | PRS_ASYNC_CH_CTRL_SIGSEL_FEFILT0WFULL)
#define PRS_ASYNC_FEFILT1_REMPTY                               (PRS_ASYNC_CH_CTRL_SOURCESEL_FEFILT1 | PRS_ASYNC_CH_CTRL_SIGSEL_FEFILT1REMPTY)
#define PRS_ASYNC_FEFILT1_WFULL                                (PRS_ASYNC_CH_CTRL_SOURCESEL_FEFILT1 | PRS_ASYNC_CH_CTRL_SIGSEL_FEFILT1WFULL)
#define PRS_ASYNC_ETAMPDET_TAMPERSRCETAMPDET                   (PRS_ASYNC_CH_CTRL_SOURCESEL_ETAMPDET | PRS_ASYNC_CH_CTRL_SIGSEL_ETAMPDETTAMPERSRCETAMPDET)
#define PRS_ASYNC_SMCTRLL_SOFTM0                               (PRS_ASYNC_CH_CTRL_SOURCESEL_SMCTRLL | PRS_ASYNC_CH_CTRL_SIGSEL_SMCTRLLSOFTM0)
#define PRS_ASYNC_SMCTRLL_SOFTM1                               (PRS_ASYNC_CH_CTRL_SOURCESEL_SMCTRLL | PRS_ASYNC_CH_CTRL_SIGSEL_SMCTRLLSOFTM1)
#define PRS_ASYNC_SMCTRLL_SOFTM2                               (PRS_ASYNC_CH_CTRL_SOURCESEL_SMCTRLL | PRS_ASYNC_CH_CTRL_SIGSEL_SMCTRLLSOFTM2)
#define PRS_ASYNC_SMCTRLL_SOFTM3                               (PRS_ASYNC_CH_CTRL_SOURCESEL_SMCTRLL | PRS_ASYNC_CH_CTRL_SIGSEL_SMCTRLLSOFTM3)
#define PRS_ASYNC_SMCTRLL_SOFTM4                               (PRS_ASYNC_CH_CTRL_SOURCESEL_SMCTRLL | PRS_ASYNC_CH_CTRL_SIGSEL_SMCTRLLSOFTM4)
#define PRS_ASYNC_SMCTRLL_SOFTM5                               (PRS_ASYNC_CH_CTRL_SOURCESEL_SMCTRLL | PRS_ASYNC_CH_CTRL_SIGSEL_SMCTRLLSOFTM5)
#define PRS_ASYNC_SMCTRLL_SOFTM6                               (PRS_ASYNC_CH_CTRL_SOURCESEL_SMCTRLL | PRS_ASYNC_CH_CTRL_SIGSEL_SMCTRLLSOFTM6)
#define PRS_ASYNC_SMCTRLL_SOFTM7                               (PRS_ASYNC_CH_CTRL_SOURCESEL_SMCTRLL | PRS_ASYNC_CH_CTRL_SIGSEL_SMCTRLLSOFTM7)
#define PRS_ASYNC_SMCTRL_SOFTM8                                (PRS_ASYNC_CH_CTRL_SOURCESEL_SMCTRL | PRS_ASYNC_CH_CTRL_SIGSEL_SMCTRLSOFTM8)
#define PRS_ASYNC_SMCTRL_SOFTM9                                (PRS_ASYNC_CH_CTRL_SOURCESEL_SMCTRL | PRS_ASYNC_CH_CTRL_SIGSEL_SMCTRLSOFTM9)
#define PRS_ASYNC_SMCTRL_SOFTM10                               (PRS_ASYNC_CH_CTRL_SOURCESEL_SMCTRL | PRS_ASYNC_CH_CTRL_SIGSEL_SMCTRLSOFTM10)
#define PRS_ASYNC_SMCTRL_SOFTM11                               (PRS_ASYNC_CH_CTRL_SOURCESEL_SMCTRL | PRS_ASYNC_CH_CTRL_SIGSEL_SMCTRLSOFTM11)

