espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_prs_signals.h
/**
 * Asynchronous signals and sources combined and aligned with register bit fields
 * without the '_ASYNCH_' infix in order for backward compatibility:
 */
#define PRS_TIMER0_UF                                          (PRS_ASYNC_TIMER0_UF)
#define PRS_TIMER0_OF                                          (PRS_ASYNC_TIMER0_OF)
#define PRS_TIMER0_CC0                                         (PRS_ASYNC_TIMER0_CC0)
#define PRS_TIMER0_CC1                                         (PRS_ASYNC_TIMER0_CC1)
#define PRS_TIMER0_CC2                                         (PRS_ASYNC_TIMER0_CC2)
#define PRS_TIMER1_UF                                          (PRS_ASYNC_TIMER1_UF)
#define PRS_TIMER1_OF                                          (PRS_ASYNC_TIMER1_OF)
#define PRS_TIMER1_CC0                                         (PRS_ASYNC_TIMER1_CC0)
#define PRS_TIMER1_CC1                                         (PRS_ASYNC_TIMER1_CC1)
#define PRS_TIMER1_CC2                                         (PRS_ASYNC_TIMER1_CC2)
#define PRS_IADC0_SCANENTRYDONE                                (PRS_ASYNC_IADC0_SCANENTRYDONE)
#define PRS_IADC0_SCANTABLEDONE                                (PRS_ASYNC_IADC0_SCANTABLEDONE)
#define PRS_IADC0_SINGLEDONE                                   (PRS_ASYNC_IADC0_SINGLEDONE)
#define PRS_LETIMER0_CH0                                       (PRS_ASYNC_LETIMER0_CH0)
#define PRS_LETIMER0_CH1                                       (PRS_ASYNC_LETIMER0_CH1)
#define PRS_BURTC_COMP                                         (PRS_ASYNC_BURTC_COMP)
#define PRS_BURTC_OVERFLOW                                     (PRS_ASYNC_BURTC_OVERFLOW)
#define PRS_GPIO_PIN0                                          (PRS_ASYNC_GPIO_PIN0)
#define PRS_GPIO_PIN1                                          (PRS_ASYNC_GPIO_PIN1)
#define PRS_GPIO_PIN2                                          (PRS_ASYNC_GPIO_PIN2)
#define PRS_GPIO_PIN3                                          (PRS_ASYNC_GPIO_PIN3)
#define PRS_GPIO_PIN4                                          (PRS_ASYNC_GPIO_PIN4)
#define PRS_GPIO_PIN5                                          (PRS_ASYNC_GPIO_PIN5)
#define PRS_GPIO_PIN6                                          (PRS_ASYNC_GPIO_PIN6)
#define PRS_GPIO_PIN7                                          (PRS_ASYNC_GPIO_PIN7)
#define PRS_TIMER2_UF                                          (PRS_ASYNC_TIMER2_UF)
#define PRS_TIMER2_OF                                          (PRS_ASYNC_TIMER2_OF)
#define PRS_TIMER2_CC0                                         (PRS_ASYNC_TIMER2_CC0)
#define PRS_TIMER2_CC1                                         (PRS_ASYNC_TIMER2_CC1)
#define PRS_TIMER2_CC2                                         (PRS_ASYNC_TIMER2_CC2)
#define PRS_TIMER3_UF                                          (PRS_ASYNC_TIMER3_UF)
#define PRS_TIMER3_OF                                          (PRS_ASYNC_TIMER3_OF)
#define PRS_TIMER3_CC0                                         (PRS_ASYNC_TIMER3_CC0)
#define PRS_TIMER3_CC1                                         (PRS_ASYNC_TIMER3_CC1)
#define PRS_TIMER3_CC2                                         (PRS_ASYNC_TIMER3_CC2)
#define PRS_CORE_CTIOUT0                                       (PRS_ASYNC_CORE_CTIOUT0)
#define PRS_CORE_CTIOUT1                                       (PRS_ASYNC_CORE_CTIOUT1)
#define PRS_CORE_CTIOUT2                                       (PRS_ASYNC_CORE_CTIOUT2)
#define PRS_CORE_CTIOUT3                                       (PRS_ASYNC_CORE_CTIOUT3)
#define PRS_CMUL_CLKOUT0                                       (PRS_ASYNC_CMUL_CLKOUT0)
#define PRS_CMUL_CLKOUT1                                       (PRS_ASYNC_CMUL_CLKOUT1)
#define PRS_CMUL_CLKOUT2                                       (PRS_ASYNC_CMUL_CLKOUT2)
#define PRS_AGCL_CCA                                           (PRS_ASYNC_AGCL_CCA)
#define PRS_AGCL_CCAREQ                                        (PRS_ASYNC_AGCL_CCAREQ)
#define PRS_AGCL_GAINADJUST                                    (PRS_ASYNC_AGCL_GAINADJUST)
#define PRS_AGCL_GAINOK                                        (PRS_ASYNC_AGCL_GAINOK)
#define PRS_AGCL_GAINREDUCED                                   (PRS_ASYNC_AGCL_GAINREDUCED)
#define PRS_AGCL_IFPKI1                                        (PRS_ASYNC_AGCL_IFPKI1)
#define PRS_AGCL_IFPKQ2                                        (PRS_ASYNC_AGCL_IFPKQ2)
#define PRS_AGCL_IFPKRST                                       (PRS_ASYNC_AGCL_IFPKRST)
#define PRS_AGC_PEAKDET                                        (PRS_ASYNC_AGC_PEAKDET)
#define PRS_AGC_PROPAGATED                                     (PRS_ASYNC_AGC_PROPAGATED)
#define PRS_AGC_RSSIDONE                                       (PRS_ASYNC_AGC_RSSIDONE)
#define PRS_BUFCL_AHBMBUSY                                     (PRS_ASYNC_BUFCL_AHBMBUSY)
#define PRS_BUFCL_HOSTCLKREQ                                   (PRS_ASYNC_BUFCL_HOSTCLKREQ)
#define PRS_BUFCL_BUFBUSY0                                     (PRS_ASYNC_BUFCL_BUFBUSY0)
#define PRS_BUFCL_BUFBUSY1                                     (PRS_ASYNC_BUFCL_BUFBUSY1)
#define PRS_BUFCL_BUFBUSY2                                     (PRS_ASYNC_BUFCL_BUFBUSY2)
#define PRS_BUFCL_BUFBUSY3                                     (PRS_ASYNC_BUFCL_BUFBUSY3)
#define PRS_MODEML_ADVANCE                                     (PRS_ASYNC_MODEML_ADVANCE)
#define PRS_MODEML_ANT0                                        (PRS_ASYNC_MODEML_ANT0)
#define PRS_MODEML_ANT1                                        (PRS_ASYNC_MODEML_ANT1)
#define PRS_MODEML_COHDSADET                                   (PRS_ASYNC_MODEML_COHDSADET)
#define PRS_MODEML_COHDSALIVE                                  (PRS_ASYNC_MODEML_COHDSALIVE)
#define PRS_MODEML_DCLK                                        (PRS_ASYNC_MODEML_DCLK)
#define PRS_MODEML_DOUT                                        (PRS_ASYNC_MODEML_DOUT)
#define PRS_MODEML_FRAMEDET                                    (PRS_ASYNC_MODEML_FRAMEDET)
#define PRS_MODEM_FRAMESENT                                    (PRS_ASYNC_MODEM_FRAMESENT)
#define PRS_MODEM_LOWCORR                                      (PRS_ASYNC_MODEM_LOWCORR)
#define PRS_MODEM_LRDSADET                                     (PRS_ASYNC_MODEM_LRDSADET)
#define PRS_MODEM_LRDSALIVE                                    (PRS_ASYNC_MODEM_LRDSALIVE)
#define PRS_MODEM_NEWSYMBOL                                    (PRS_ASYNC_MODEM_NEWSYMBOL)
#define PRS_MODEM_NEWWND                                       (PRS_ASYNC_MODEM_NEWWND)
#define PRS_MODEM_POSTPONE                                     (PRS_ASYNC_MODEM_POSTPONE)
#define PRS_MODEM_PREDET                                       (PRS_ASYNC_MODEM_PREDET)
#define PRS_MODEMH_PRESENT                                     (PRS_ASYNC_MODEMH_PRESENT)
#define PRS_MODEMH_RSSIJUMP                                    (PRS_ASYNC_MODEMH_RSSIJUMP)
#define PRS_MODEMH_SYNCSENT                                    (PRS_ASYNC_MODEMH_SYNCSENT)
#define PRS_MODEMH_TIMDET                                      (PRS_ASYNC_MODEMH_TIMDET)
#define PRS_MODEMH_WEAK                                        (PRS_ASYNC_MODEMH_WEAK)
#define PRS_MODEMH_EOF                                         (PRS_ASYNC_MODEMH_EOF)
#define PRS_FRC_DCLK                                           (PRS_ASYNC_FRC_DCLK)
#define PRS_FRC_DOUT                                           (PRS_ASYNC_FRC_DOUT)
#define PRS_PROTIMERL_BOF                                      (PRS_ASYNC_PROTIMERL_BOF)
#define PRS_PROTIMERL_CC0                                      (PRS_ASYNC_PROTIMERL_CC0)
#define PRS_PROTIMERL_CC1                                      (PRS_ASYNC_PROTIMERL_CC1)
#define PRS_PROTIMERL_CC2                                      (PRS_ASYNC_PROTIMERL_CC2)
#define PRS_PROTIMERL_CC3                                      (PRS_ASYNC_PROTIMERL_CC3)
#define PRS_PROTIMERL_CC4                                      (PRS_ASYNC_PROTIMERL_CC4)
#define PRS_PROTIMERL_LBTF                                     (PRS_ASYNC_PROTIMERL_LBTF)
#define PRS_PROTIMERL_LBTR                                     (PRS_ASYNC_PROTIMERL_LBTR)
#define PRS_PROTIMER_LBTS                                      (PRS_ASYNC_PROTIMER_LBTS)
#define PRS_PROTIMER_POF                                       (PRS_ASYNC_PROTIMER_POF)
#define PRS_PROTIMER_T0MATCH                                   (PRS_ASYNC_PROTIMER_T0MATCH)
#define PRS_PROTIMER_T0UF                                      (PRS_ASYNC_PROTIMER_T0UF)
#define PRS_PROTIMER_T1MATCH                                   (PRS_ASYNC_PROTIMER_T1MATCH)
#define PRS_PROTIMER_T1UF                                      (PRS_ASYNC_PROTIMER_T1UF)
#define PRS_PROTIMER_WOF                                       (PRS_ASYNC_PROTIMER_WOF)
#define PRS_SYNTH_MUX0                                         (PRS_ASYNC_SYNTH_MUX0)
#define PRS_SYNTH_MUX1                                         (PRS_ASYNC_SYNTH_MUX1)
#define PRS_PRSL_ASYNCH0                                       (PRS_ASYNC_PRSL_ASYNCH0)
#define PRS_PRSL_ASYNCH1                                       (PRS_ASYNC_PRSL_ASYNCH1)
#define PRS_PRSL_ASYNCH2                                       (PRS_ASYNC_PRSL_ASYNCH2)
#define PRS_PRSL_ASYNCH3                                       (PRS_ASYNC_PRSL_ASYNCH3)
#define PRS_PRSL_ASYNCH4                                       (PRS_ASYNC_PRSL_ASYNCH4)
#define PRS_PRSL_ASYNCH5                                       (PRS_ASYNC_PRSL_ASYNCH5)
#define PRS_PRSL_ASYNCH6                                       (PRS_ASYNC_PRSL_ASYNCH6)
#define PRS_PRSL_ASYNCH7                                       (PRS_ASYNC_PRSL_ASYNCH7)
#define PRS_PRS_ASYNCH8                                        (PRS_ASYNC_PRS_ASYNCH8)
#define PRS_PRS_ASYNCH9                                        (PRS_ASYNC_PRS_ASYNCH9)
#define PRS_PRS_ASYNCH10                                       (PRS_ASYNC_PRS_ASYNCH10)
#define PRS_PRS_ASYNCH11                                       (PRS_ASYNC_PRS_ASYNCH11)
#define PRS_RACL_ACTIVE                                        (PRS_ASYNC_RACL_ACTIVE)
#define PRS_RACL_LNAEN                                         (PRS_ASYNC_RACL_LNAEN)
#define PRS_RACL_PAEN                                          (PRS_ASYNC_RACL_PAEN)
#define PRS_RACL_RX                                            (PRS_ASYNC_RACL_RX)
#define PRS_RACL_TX                                            (PRS_ASYNC_RACL_TX)
#define PRS_RACL_CTIOUT0                                       (PRS_ASYNC_RACL_CTIOUT0)
#define PRS_RACL_CTIOUT1                                       (PRS_ASYNC_RACL_CTIOUT1)
#define PRS_RACL_CTIOUT2                                       (PRS_ASYNC_RACL_CTIOUT2)
#define PRS_RAC_CTIOUT3                                        (PRS_ASYNC_RAC_CTIOUT3)
#define PRS_RAC_AUXADCDATA                                     (PRS_ASYNC_RAC_AUXADCDATA)
#define PRS_RAC_AUXADCDATAVALID                                (PRS_ASYNC_RAC_AUXADCDATAVALID)
#define PRS_TIMER4_UF                                          (PRS_ASYNC_TIMER4_UF)
#define PRS_TIMER4_OF                                          (PRS_ASYNC_TIMER4_OF)
#define PRS_TIMER4_CC0                                         (PRS_ASYNC_TIMER4_CC0)
#define PRS_TIMER4_CC1                                         (PRS_ASYNC_TIMER4_CC1)
#define PRS_TIMER4_CC2                                         (PRS_ASYNC_TIMER4_CC2)
#define PRS_ACMP0_OUT                                          (PRS_ASYNC_ACMP0_OUT)
#define PRS_ACMP1_OUT                                          (PRS_ASYNC_ACMP1_OUT)
#define PRS_VDAC0L_CH0WARM                                     (PRS_ASYNC_VDAC0L_CH0WARM)
#define PRS_VDAC0L_CH1WARM                                     (PRS_ASYNC_VDAC0L_CH1WARM)
#define PRS_VDAC0L_CH0DONEASYNC                                (PRS_ASYNC_VDAC0L_CH0DONEASYNC)
#define PRS_VDAC0L_CH1DONEASYNC                                (PRS_ASYNC_VDAC0L_CH1DONEASYNC)
#define PRS_VDAC0L_INTERNALTIMEROF                             (PRS_ASYNC_VDAC0L_INTERNALTIMEROF)
#define PRS_VDAC0L_REFRESHTIMEROF                              (PRS_ASYNC_VDAC0L_REFRESHTIMEROF)
#define PRS_PCNT0_DIR                                          (PRS_ASYNC_PCNT0_DIR)
#define PRS_PCNT0_UFOF                                         (PRS_ASYNC_PCNT0_UFOF)
#define PRS_SYSRTC0_GRP0OUT0                                   (PRS_ASYNC_SYSRTC0_GRP0OUT0)
#define PRS_SYSRTC0_GRP0OUT1                                   (PRS_ASYNC_SYSRTC0_GRP0OUT1)
#define PRS_SYSRTC0_GRP1OUT0                                   (PRS_ASYNC_SYSRTC0_GRP1OUT0)
#define PRS_SYSRTC0_GRP1OUT1                                   (PRS_ASYNC_SYSRTC0_GRP1OUT1)
#define PRS_LESENSE_DECOUT0                                    (PRS_ASYNC_LESENSE_DECOUT0)
#define PRS_LESENSE_DECOUT1                                    (PRS_ASYNC_LESENSE_DECOUT1)
#define PRS_LESENSE_DECOUT2                                    (PRS_ASYNC_LESENSE_DECOUT2)
#define PRS_LESENSE_DECCMP                                     (PRS_ASYNC_LESENSE_DECCMP)
#define PRS_HFXO0L_STATUS                                      (PRS_ASYNC_HFXO0L_STATUS)
#define PRS_HFXO0L_STATUS1                                     (PRS_ASYNC_HFXO0L_STATUS1)
#define PRS_EUSART0L_CS                                        (PRS_ASYNC_EUSART0L_CS)
#define PRS_EUSART0L_IRDATX                                    (PRS_ASYNC_EUSART0L_IRDATX)
#define PRS_EUSART0L_RTS                                       (PRS_ASYNC_EUSART0L_RTS)
#define PRS_EUSART0L_RXDATAV                                   (PRS_ASYNC_EUSART0L_RXDATAV)
#define PRS_EUSART0L_TX                                        (PRS_ASYNC_EUSART0L_TX)
#define PRS_EUSART0L_TXC                                       (PRS_ASYNC_EUSART0L_TXC)
#define PRS_EUSART0L_RXFL                                      (PRS_ASYNC_EUSART0L_RXFL)
#define PRS_EUSART0L_TXFL                                      (PRS_ASYNC_EUSART0L_TXFL)
#define PRS_EUSART1L_CS                                        (PRS_ASYNC_EUSART1L_CS)
#define PRS_EUSART1L_IRDATX                                    (PRS_ASYNC_EUSART1L_IRDATX)
#define PRS_EUSART1L_RTS                                       (PRS_ASYNC_EUSART1L_RTS)
#define PRS_EUSART1L_RXDATAV                                   (PRS_ASYNC_EUSART1L_RXDATAV)
#define PRS_EUSART1L_TX                                        (PRS_ASYNC_EUSART1L_TX)
#define PRS_EUSART1L_TXC                                       (PRS_ASYNC_EUSART1L_TXC)
#define PRS_EUSART1L_RXFL                                      (PRS_ASYNC_EUSART1L_RXFL)
#define PRS_EUSART1L_TXFL                                      (PRS_ASYNC_EUSART1L_TXFL)
#define PRS_EUSART2L_CS                                        (PRS_ASYNC_EUSART2L_CS)
#define PRS_EUSART2L_IRDATX                                    (PRS_ASYNC_EUSART2L_IRDATX)
#define PRS_EUSART2L_RTS                                       (PRS_ASYNC_EUSART2L_RTS)
#define PRS_EUSART2L_RXDATAV                                   (PRS_ASYNC_EUSART2L_RXDATAV)
#define PRS_EUSART2L_TX                                        (PRS_ASYNC_EUSART2L_TX)
#define PRS_EUSART2L_TXC                                       (PRS_ASYNC_EUSART2L_TXC)
#define PRS_EUSART2L_RXFL                                      (PRS_ASYNC_EUSART2L_RXFL)
#define PRS_EUSART2L_TXFL                                      (PRS_ASYNC_EUSART2L_TXFL)
#define PRS_EUSART3L_CS                                        (PRS_ASYNC_EUSART3L_CS)
#define PRS_EUSART3L_IRDATX                                    (PRS_ASYNC_EUSART3L_IRDATX)
#define PRS_EUSART3L_RTS                                       (PRS_ASYNC_EUSART3L_RTS)
#define PRS_EUSART3L_RXDATAV                                   (PRS_ASYNC_EUSART3L_RXDATAV)
#define PRS_EUSART3L_RXFL                                      (PRS_ASYNC_EUSART3L_RXFL)
#define PRS_EUSART3L_TX                                        (PRS_ASYNC_EUSART3L_TX)
#define PRS_EUSART3L_TXC                                       (PRS_ASYNC_EUSART3L_TXC)
#define PRS_EUSART3L_TXFL                                      (PRS_ASYNC_EUSART3L_TXFL)
#define PRS_EUSART4L_CS                                        (PRS_ASYNC_EUSART4L_CS)
#define PRS_EUSART4L_IRDATX                                    (PRS_ASYNC_EUSART4L_IRDATX)
#define PRS_EUSART4L_RTS                                       (PRS_ASYNC_EUSART4L_RTS)
#define PRS_EUSART4L_RXDATAV                                   (PRS_ASYNC_EUSART4L_RXDATAV)
#define PRS_EUSART4L_RXFL                                      (PRS_ASYNC_EUSART4L_RXFL)
#define PRS_EUSART4L_TX                                        (PRS_ASYNC_EUSART4L_TX)
#define PRS_EUSART4L_TXC                                       (PRS_ASYNC_EUSART4L_TXC)
#define PRS_EUSART4L_TXFL                                      (PRS_ASYNC_EUSART4L_TXFL)
#define PRS_TIMER5_UF                                          (PRS_ASYNC_TIMER5_UF)
#define PRS_TIMER5_OF                                          (PRS_ASYNC_TIMER5_OF)
#define PRS_TIMER5_CC0                                         (PRS_ASYNC_TIMER5_CC0)
#define PRS_TIMER5_CC2                                         (PRS_ASYNC_TIMER5_CC2)
#define PRS_TIMER5_CC1                                         (PRS_ASYNC_TIMER5_CC1)
#define PRS_TIMER6_UF                                          (PRS_ASYNC_TIMER6_UF)
#define PRS_TIMER6_OF                                          (PRS_ASYNC_TIMER6_OF)
#define PRS_TIMER6_CC0                                         (PRS_ASYNC_TIMER6_CC0)
#define PRS_TIMER6_CC1                                         (PRS_ASYNC_TIMER6_CC1)
#define PRS_TIMER6_CC2                                         (PRS_ASYNC_TIMER6_CC2)
#define PRS_TIMER7_UF                                          (PRS_ASYNC_TIMER7_UF)
#define PRS_TIMER7_OF                                          (PRS_ASYNC_TIMER7_OF)
#define PRS_TIMER7_CC0                                         (PRS_ASYNC_TIMER7_CC0)
#define PRS_TIMER7_CC1                                         (PRS_ASYNC_TIMER7_CC1)
#define PRS_TIMER7_CC2                                         (PRS_ASYNC_TIMER7_CC2)
#define PRS_RFFPLL0L_CLKDIGDIV4                                (PRS_ASYNC_RFFPLL0L_CLKDIGDIV4)
#define PRS_RFFPLL0L_CLKMODEMDIV4                              (PRS_ASYNC_RFFPLL0L_CLKMODEMDIV4)
#define PRS_FEFILT0_REMPTY                                     (PRS_ASYNC_FEFILT0_REMPTY)
#define PRS_FEFILT0_WFULL                                      (PRS_ASYNC_FEFILT0_WFULL)
#define PRS_FEFILT1_REMPTY                                     (PRS_ASYNC_FEFILT1_REMPTY)
#define PRS_FEFILT1_WFULL                                      (PRS_ASYNC_FEFILT1_WFULL)
#define PRS_ETAMPDET_TAMPERSRCETAMPDET                         (PRS_ASYNC_ETAMPDET_TAMPERSRCETAMPDET)
#define PRS_SMCTRLL_SOFTM0                                     (PRS_ASYNC_SMCTRLL_SOFTM0)
#define PRS_SMCTRLL_SOFTM1                                     (PRS_ASYNC_SMCTRLL_SOFTM1)
#define PRS_SMCTRLL_SOFTM2                                     (PRS_ASYNC_SMCTRLL_SOFTM2)
#define PRS_SMCTRLL_SOFTM3                                     (PRS_ASYNC_SMCTRLL_SOFTM3)
#define PRS_SMCTRLL_SOFTM4                                     (PRS_ASYNC_SMCTRLL_SOFTM4)
#define PRS_SMCTRLL_SOFTM5                                     (PRS_ASYNC_SMCTRLL_SOFTM5)
#define PRS_SMCTRLL_SOFTM6                                     (PRS_ASYNC_SMCTRLL_SOFTM6)
#define PRS_SMCTRLL_SOFTM7                                     (PRS_ASYNC_SMCTRLL_SOFTM7)
#define PRS_SMCTRL_SOFTM8                                      (PRS_ASYNC_SMCTRL_SOFTM8)
#define PRS_SMCTRL_SOFTM9                                      (PRS_ASYNC_SMCTRL_SOFTM9)
#define PRS_SMCTRL_SOFTM10                                     (PRS_ASYNC_SMCTRL_SOFTM10)
#define PRS_SMCTRL_SOFTM11                                     (PRS_ASYNC_SMCTRL_SOFTM11)

#endif /* EFR32FG25_PRS_SIGNALS_H */
